//
//  BKPasscodeView.strings
//  TheBox iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

"%d Failed Passcode Attempts" = "%d epäonnistunutta pääsykoodiyritystä";
"%d Failed Password Attempts" = "%d epäonnistunutta salasanayritystä";

"1 Failed Passcode Attempt" = "1 epäonnistunut pääsykoodiyritys";
"1 Failed Password Attempt" = "1 epäonnistunut salasanayritys";

"Do you want to use Touch ID for authentication?" = "Haluatko käyttää Touch ID -sormenjälkitunnistusta?";

"Done" = "Valmis";

"Enable Touch ID" = "Aktivoi Touch ID";

"Enter a different passcode. Cannot re-use the same passcode." = "Syötä eri pääsykoodi. Et voi uudelleenkäyttää samaa pääsykoodia.";
"Enter a different password. Cannot re-use the same password." = "Syötä eri salasana. Et voi uudelleenkäyttää samaa salasanaa.";

"Enter a passcode" = "Syötä pääsykoodi";
"Enter a password" = "Syötä salasana";

"Enter your new passcode" = "Syötä uusi pääsykoodi";
"Enter your new password" = "Syötä uusi salasana";

"Enter your old passcode" = "Syötä vanha pääsykoodi";
"Enter your old password" = "Syötä vanha salasana";

"Enter your passcode" = "Syötä pääsykoodisi";
"Enter your password" = "Syötä salasanasi";

"Invalid Passcode" = "Virheellinen pääsykoodi";
"Invalid Password" = "Virheellinen salasana";

"Passcodes did not match.\nTry again." = "Pääsykoodit eivät täsmänneet.\nYritä uudelleen.";
"Password did not match.\nTry again." = "Salasanat eivät täsmänneet.\nYritä uudelleen.";

"Re-enter your passcode" = "Uudelleensyötä pääsykoodi";
"Re-enter your password" = "Uudelleensyötä salasana";

"Try again in %d minutes" = "Yritä uudelleen %d minuutin kuluttua";

"Try again in 1 minute" = "Yritä uudelleen 1 minuutin kuluttua";
